ush/ManifestDestiny.tex
% Created 2021-09-20 Mon 13:59
% Intended LaTeX compiler: pdflatex
\documentclass{scrartcl}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fontspec}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage[dvipsnames]{xcolor}
\usepackage[colorlinks=true, linkcolor=Blue, citecolor=BrickRed, urlcolor=PineGreen]{hyperref}
\usepackage{indentfirst}
\setmainfont[Ligatures=TeX]{Alegreya}
\setmonofont[Ligatures=TeX]{Liga SFMono Nerd Font}
% features: (par-sep)
\setlength{\parskip}{\baselineskip}
\setlength{\parindent}{0pt}

% end features

%% make document follow Emacs theme

\definecolor{obg}{HTML}{fafafa}
\definecolor{ofg}{HTML}{383a42}

\pagecolor{obg}
\color{ofg}

% list labels

\definecolor{itemlabel}{HTML}{4078f2}

\renewcommand{\labelitemi}{\textcolor{itemlabel}{\textbullet}}
\renewcommand{\labelitemii}{\textcolor{itemlabel}{\normalfont\bfseries \textendash}}
\renewcommand{\labelitemiii}{\textcolor{itemlabel}{\textasteriskcentered}}
\renewcommand{\labelitemiv}{\textcolor{itemlabel}{\textperiodcentered}}

\renewcommand{\labelenumi}{\textcolor{itemlabel}{\theenumi.}}
\renewcommand{\labelenumii}{\textcolor{itemlabel}{(\theenumii)}}
\renewcommand{\labelenumiii}{\textcolor{itemlabel}{\theenumiii.}}
\renewcommand{\labelenumiv}{\textcolor{itemlabel}{\theenumiv.}}

% structural elements

\definecolor{documentTitle}{HTML}{a626a4}
\definecolor{documentInfo}{HTML}{a626a4}
\definecolor{level1}{HTML}{e45649}
\definecolor{level2}{HTML}{da8548}
\definecolor{level3}{HTML}{b751b6}
\definecolor{level4}{HTML}{6f99f5}
\definecolor{level5}{HTML}{bc5cba}
\definecolor{level6}{HTML}{9fbbf8}
\definecolor{level7}{HTML}{d292d1}
\definecolor{level8}{HTML}{d8e4fc}

\addtokomafont{title}{\color{documentTitle}}
\addtokomafont{author}{\color{documentInfo}}
\addtokomafont{date}{\color{documentInfo}}
\addtokomafont{section}{\color{level1}}
\newkomafont{sectionprefix}{\color{level1}}
\addtokomafont{subsection}{\color{level2}}
\newkomafont{subsectionprefix}{\color{level2}}
\addtokomafont{subsubsection}{\color{level3}}
\newkomafont{subsubsectionprefix}{\color{level3}}
\addtokomafont{paragraph}{\color{level4}}
\newkomafont{paragraphprefix}{\color{level4}}
\addtokomafont{subparagraph}{\color{level5}}
\newkomafont{subparagraphprefix}{\color{level5}}

% textual elements

\definecolor{link}{HTML}{4078f2}
\definecolor{cite}{HTML}{4aa8b0}
\definecolor{itemlabel}{HTML}{4078f2}
\definecolor{code}{HTML}{da8548}
\definecolor{verbatim}{HTML}{50a14f}

\renewcommand{\labelitemi}{\textcolor{itemlabel}{\textbullet}}
\renewcommand{\labelitemii}{\textcolor{itemlabel}{\normalfont\bfseries \textendash}}
\renewcommand{\labelitemiii}{\textcolor{itemlabel}{\textasteriskcentered}}
\renewcommand{\labelitemiv}{\textcolor{itemlabel}{\textperiodcentered}}

\renewcommand{\labelenumi}{\textcolor{itemlabel}{\theenumi.}}
\renewcommand{\labelenumii}{\textcolor{itemlabel}{(\theenumii)}}
\renewcommand{\labelenumiii}{\textcolor{itemlabel}{\theenumiii.}}
\renewcommand{\labelenumiv}{\textcolor{itemlabel}{\theenumiv.}}

\DeclareTextFontCommand{\texttt}{\color{code}\ttfamily}
\makeatletter
\def\verbatim@font{\color{verbatim}\normalfont\ttfamily}
\makeatother

% code blocks

\definecolor{codebackground}{HTML}{f6f6f6}
\colorlet{EFD}{ofg}
\definecolor{codeborder}{HTML}{f0f0f0}

%% end customisations

\author{Shaurya Singh}
\date{\today}
\title{Manifest Destiny \#1}
\colorlet{greenyblue}{blue!70!green}
\colorlet{blueygreen}{blue!40!green}
\providecolor{link}{named}{greenyblue}
\providecolor{cite}{named}{blueygreen}
\hypersetup{
  pdfauthor={Shaurya Singh},
  pdftitle={Manifest Destiny \#1},
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 28.0.50 (Org mode 9.5)},
  pdflang={English},
  breaklinks=true,
  colorlinks=true,
  linkcolor=,
  urlcolor=link,
  citecolor=cite
}
\urlstyle{same}
\begin{document}

\maketitle

\section{Why did Americans think they were so special?}
\label{sec:org399c913}
From the wording used in the text, it appears the American's of the time thought
of themselves as the nation of \emph{progress, individual freedom, of universal enfranchisement}. They believed that America was the work of God, and that
America has been chosen for a mission, that only we can put an end to the
tyranny of kings, as opposed to other nations who are \emph{shut out from the live-giving of truth}. Americans believed their nation was destined to be the
greatest nation of the future, and their expansion was justified as a work of
God.

At the time, almost no nation had defended against a monarchy, and gained
independance against a power such as Britain. High of their horses, the
Americans didn't think of expansion as much more.

\section{Are you surprised by the reasons that O’Sullivan gives for expansion?}
\label{sec:org0e2a765}
By modern standards, I am surprised. O’Sullivan's reasoning for expansion cannot
be proven, as it depends on God and religous ideals. He our expansion and
annexation of texas is just the fullfillment of the Manifest Destiny, and that
the opposition is \emph{hampering our power, [and] limiting our greatness}.

On top of this, O'Sullivan is contradicting himself and sperading inaccurate
information. He mentions that our country is based on individual freedom, yet we
still have slaves. He said that we have universal enfranchisement, yet the only
people who could vote at the time were white men.

In the modern day and age, we don't justify reasoning through religious ideals,
rather we back it up with debate, science, and facts. Had a similar piece of
text been submitted to a newspaper or other work, it would be rejected
immediately.

However, by the standards back then, this isn't very surprising. In the 1800's
science and debate was close to nonexistant, and statements were based on either
religious ideals or opinions given by journalists and officials. People thought
that America was the nation created by god, and everyone followed this
religious mindset back then

\section{This theory that Americans are special is called “American Exceptionalism.” It’s this idea that America has had such a unique history and has become so powerful that there’s something really special about it. What do you think about this theory? Is it still present today? Explain why/why not}
\label{sec:orgda230da}
This issue is very much still present today, although to a lesser extent. Every
time an election nears, or a national event occurs, many justify their rash
actions through ``Patriotism''. Rather than back up statements with logic, many
people base it off of innacurate, opinionated news sources, as well as religious
ideals, similar to the mindset described earlier.
\end{document}
